// დაწერეთ პროგრამა მასივში რიცხვების საშუალოს საპოვნელად.

// let arr = [1,2,3,4,5,6,7]
//     let result = arr.length/2
//     console.log(result)

// დაწერეთ პროგრამა, რომ იპოვოთ მასივის ყველა რიცხვის ჯამი.

// let arr = [1,3,4,56,8]
// let result = 0
//  for(let i = 0;i<arr.length;i++){
//      result = result + arr[i]
//  }
//  console.log(result)



// დაწერეთ პროგრამა რიცხვების მასივის ზრდის მიხედვით დასალაგებლად.

//  let arr = [1,3,4,56,8]
// let result = arr.toSorted((a,b) => a+b)
// console.log(result)
 
//  დაწერეთ პროგრამა მასივში ყველაზე დიდი ელემენტის მოსაძებნად.

// let arr =[1,34,6576,8789,45444,34] 
//     let maxNum = Math.max(...arr)
// console.log(maxNum)
    
// დაწერეთ პროგრამა მასივის ყველაზე პატარა ელემენტის მოსაძებნად.

// let arr =[1,34,6576,8789,45444,34] 
//     let minNum = Math.min(...arr)
// console.log(minNum)

// დაწერეთ პროგრამა, რათა შეამოწმოთ, შეიცავს თუ არა მასივი კონკრეტულ ელემენტს.

// let arr =[1,34,6576,8789,45444,34,77] 

// console.log(arr.includes(77))

// დაწერეთ პროგრამა მასივიდან ელემენტის ამოსაღებად.

//  let arr =[1,34,6576,8789,45444,34,77]

// console.log(arr[6])
