// week 1
// დაწერეთ პროგრამა რომელიც კონსოლში გამოიტანს "Hello World" -ს.
// console.log("Hello World")
// შექმენით ცვლადი და მიანიჭეთ მას რიცხვი. დაბეჭდეთ ცვლადის მნიშვნელობა.
// let a = 7
// console.log(a)
//დაწერეთ პროგრამა ორი რიცხვის შესაკრებად და შედეგის გამოსატანად.
// let  a = 7
// let b = 3
// console.log(a+b)
//დაწერეთ პროგრამა რომელიც გამოაკლებს ორ რიცხვს ერთმანეთს და აჩვენებს შედეგს.
// let a = 7
// let b = 6
// console.log(a-b)
//დაწერეთ პროგრამა ორი რიცხვის გასამრავლებლად და შედეგის გამოსატანად.
// let a = 7
// let b = 7
// console.log(a * b)
// დაწერეთ პროგრამა ორი რიცხვის გასაყოფად და შედეგის გამოსატანად.
// let a = 7
// let b = 7
// console.log(a / b)
//დაწერეთ პროგრამა ორი რიცხვის გაყოფის ნაშთის გამოსათვლელად.
// let a = 10
// let b = 3
// console.log(a % b )
//შექმენით ცვლადი და მიანიჭეთ მას სტრიქონი. ამობეჭდეთ სტრიქონის სიგრძე.
// let a = "Hello"
// console.log(a.length)
//დაწერეთ პროგრამა ორი სტრიქონის შესაერთებლად და შედეგის ჩვენების მიზნით.
// let a = "Hello"
// let b = "World"
// console.log( a +" "+b )
// დაწერეთ პროგრამა სტრიქონის დიდ ასოებზე გადასაყვანად.
// let a = "hello"
// console.log(a.toUpperCase())
//დაწერეთ პროგრამა სტრიქონის მცირე ასოზე გადასაყვანად.
// let a = "HELLO"
// console.log(a.toLowerCase())